Microchip-MPLAB-Harmony/usb/apps/host/msd_basic/firmware/src/config/pic32mk_sk/driver/usb/usbfs/src/plib_usbfs_header.h
/*******************************************************************************
* Copyright (C) 2019 Microchip Technology Inc. and its subsidiaries.
*
* Subject to your compliance with these terms, you may use Microchip software
* and any derivatives exclusively with Microchip products. It is your
* responsibility to comply with third party license terms applicable to your
* use of third party software (including open source software) that may
* accompany Microchip software.
*
* THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
* EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
* WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
* PARTICULAR PURPOSE.
*
* IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
* INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
* WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
* BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
* FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
* ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
* THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
*******************************************************************************/

/* Created by plibgen $Revision: 1.31 $ */


#ifndef _PLIB_USBFS_H
#define _PLIB_USBFS_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>



/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
     #define PLIB_INLINE_API static inline 
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
     #define PLIB_INLINE static inline 
#endif

#ifndef _PLIB_UNSUPPORTED
    #define _PLIB_UNSUPPORTED 
#endif

#ifndef PLIB_ASSERT
    #define PLIB_ASSERT(a,b)  
#endif 

typedef enum {

    USB_ID_1 = _USB_BASE_ADDRESS,
	USB_ID_2 = _USB2_BASE_ADDRESS,
    USB_NUMBER_OF_MODULES = 2

} USB_MODULE_ID;

typedef enum {

    USB_INT_DEVICE_RESET = 0x01,
    USB_INT_ERROR = 0x02,
    USB_INT_TOKEN_DONE = 0x08,
    USB_INT_IDLE_DETECT = 0x10,
    USB_INT_STALL = 0x80,
    USB_INT_SOF = 0x04,
    USB_INT_HOST_DETACH = 0x01,
    USB_INT_RESUME = 0x20,
    USB_INT_ATTACH = 0x40,
    USB_INT_ANY = 0xFF,
    USB_INT_ALL = 0xFF

} USB_INTERRUPTS;

typedef enum {

    USB_ERR_INT_PID_CHECK_FAILURE = 0x01,
    USB_ERR_INT_BAD_CRC5 = 0x02,
    USB_ERR_INT_BAD_CRC16 = 0x04,
    USB_ERR_INT_BAD_DATA_FIELD_SIZE = 0x08,
    USB_ERR_INT_BUS_TURNAROUND_TIMEOUT = 0x10,
    USB_ERR_INT_BIT_STUFF_ERROR = 0x80,
    USB_ERR_INT_HOST_EOF_ERROR = 0x02,
    USB_ERR_INT_DMA_ERROR = 0x20,
    USB_ERR_INT_BUS_MATRIX_ERROR = 0x40,
    USB_ERR_INT_ANY = 0xFF,
    USB_ERR_INT_ALL = 0xFF

} USB_ERROR_INTERRUPTS;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "driver/usb/usbfs/src/templates/usb_OTG_InterruptStatus_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_Interrupt_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_IDPinState_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_LineState_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_SessionValid_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_BSessionEnd_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_ASessionValid_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_PullUpPullDown_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_VbusPowerOnOff_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_VbusCharge_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OTG_VbusDischarge_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ActivityPending_Default.h"
#include "driver/usb/usbfs/src/templates/usb_SleepEntryGuard_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ModuleBusy_Default.h"
#include "driver/usb/usbfs/src/templates/usb_Suspend_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ModulePower_32Bit16Bit.h"
#include "driver/usb/usbfs/src/templates/usb_GEN_InterruptStatus_Default.h"
#include "driver/usb/usbfs/src/templates/usb_GEN_Interrupt_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ALL_Interrupt_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ERR_InterruptStatus_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ERR_Interrupt_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LastEndpoint_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LastDirection_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LastPingPong_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LastTransactionDetails_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LiveJState_Default.h"
#include "driver/usb/usbfs/src/templates/usb_LiveSingleEndedZero_Default.h"
#include "driver/usb/usbfs/src/templates/usb_PacketTransfer_Default.h"
#include "driver/usb/usbfs/src/templates/usb_HostBusyWithToken_Default.h"
#include "driver/usb/usbfs/src/templates/usb_HostGeneratesReset_Default.h"
#include "driver/usb/usbfs/src/templates/usb_OpModeSelect_Default.h"
#include "driver/usb/usbfs/src/templates/usb_ResumeSignaling_Default.h"
#include "driver/usb/usbfs/src/templates/usb_BufferFreeze_Default.h"
#include "driver/usb/usbfs/src/templates/usb_StartOfFrames_Default.h"
#include "driver/usb/usbfs/src/templates/usb_NextTokenSpeed_Default.h"
#include "driver/usb/usbfs/src/templates/usb_DeviceAddress_Default.h"
#include "driver/usb/usbfs/src/templates/usb_FrameNumber_Default.h"
#include "driver/usb/usbfs/src/templates/usb_TokenPID_Default.h"
#include "driver/usb/usbfs/src/templates/usb_TokenEP_Default.h"
#include "driver/usb/usbfs/src/templates/usb_SOFThreshold_Default.h"
#include "driver/usb/usbfs/src/templates/usb_BDTBaseAddress_Default.h"
#include "driver/usb/usbfs/src/templates/usb_EyePattern_Default.h"
#include "driver/usb/usbfs/src/templates/usb_StopInIdle_Default.h"
#include "driver/usb/usbfs/src/templates/usb_AutomaticSuspend_Default.h"
#include "driver/usb/usbfs/src/templates/usb_PingPongMode_Unsupported.h"
#include "driver/usb/usbfs/src/templates/usb_UOEMonitor_Unsupported.h"
#include "driver/usb/usbfs/src/templates/usb_OnChipPullup_Unsupported.h"
#include "driver/usb/usbfs/src/templates/usb_OnChipTransceiver_Unsupported.h"
#include "driver/usb/usbfs/src/templates/usb_SpeedControl_Unsupported.h"
#include "driver/usb/usbfs/src/templates/usb_EP0LowSpeedConnect_Default.h"
#include "driver/usb/usbfs/src/templates/usb_EP0NAKRetry_Default.h"
#include "driver/usb/usbfs/src/templates/usb_EPnTxRx_Default.h"
#include "driver/usb/usbfs/src/templates/usb_EPnRxEnableEnhanced_PIC32.h"
#include "driver/usb/usbfs/src/templates/usb_BDTFunctions_PIC32.h"

