Microchip-MPLAB-Harmony/usb/apps/host/msd_basic/firmware/src/config/pic32mk_sk/driver/usb/usbfs/src/plib_usbfs_header.h
/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagSet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptFlagSet_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagClear(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptFlagClear_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptFlagGet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     return USB_OTG_InterruptFlagGet_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_InterruptStatus(USB_MODULE_ID index)
{
     return USB_ExistsOTG_InterruptStatus_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptEnable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptDisable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     return USB_OTG_InterruptIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_Interrupt(USB_MODULE_ID index)
{
     return USB_ExistsOTG_Interrupt_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_IDPinStateIsTypeA(USB_MODULE_ID index)
{
     return USB_OTG_IDPinStateIsTypeA_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_IDPinState(USB_MODULE_ID index)
{
     return USB_ExistsOTG_IDPinState_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_LineStateIsStable(USB_MODULE_ID index)
{
     return USB_OTG_LineStateIsStable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_LineState(USB_MODULE_ID index)
{
     return USB_ExistsOTG_LineState_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_SessionValid(USB_MODULE_ID index)
{
     return USB_OTG_SessionValid_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_SessionValid(USB_MODULE_ID index)
{
     return USB_ExistsOTG_SessionValid_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_BSessionHasEnded(USB_MODULE_ID index)
{
     return USB_OTG_BSessionHasEnded_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_BSessionEnd(USB_MODULE_ID index)
{
     return USB_ExistsOTG_BSessionEnd_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_VBusValid(USB_MODULE_ID index)
{
     return USB_OTG_VBusValid_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_ASessionValid(USB_MODULE_ID index)
{
     return USB_ExistsOTG_ASessionValid_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_PullUpPullDownSetup(USB_MODULE_ID index, USB_OTG_PULL_UP_PULL_DOWN resistor, bool enableResistor)
{
     USB_OTG_PullUpPullDownSetup_Default(index, resistor, enableResistor);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_PullUpPullDown(USB_MODULE_ID index)
{
     return USB_ExistsOTG_PullUpPullDown_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusPowerOff(USB_MODULE_ID index)
{
     USB_OTG_VBusPowerOff_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusPowerOn(USB_MODULE_ID index)
{
     USB_OTG_VBusPowerOn_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusPowerOnOff(USB_MODULE_ID index)
{
     return USB_ExistsOTG_VbusPowerOnOff_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusChargeEnable(USB_MODULE_ID index)
{
     USB_OTG_VBusChargeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusChargeDisable(USB_MODULE_ID index)
{
     USB_OTG_VBusChargeDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusCharge(USB_MODULE_ID index)
{
     return USB_ExistsOTG_VbusCharge_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusDischargeEnable(USB_MODULE_ID index)
{
     USB_OTG_VBusDischargeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusDischargeDisable(USB_MODULE_ID index)
{
     USB_OTG_VBusDischargeDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusDischarge(USB_MODULE_ID index)
{
     return USB_ExistsOTG_VbusDischarge_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ActivityPending(USB_MODULE_ID index)
{
     return USB_ActivityPending_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsActivityPending(USB_MODULE_ID index)
{
     return USB_ExistsActivityPending_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SleepGuardEnable(USB_MODULE_ID index)
{
     USB_SleepGuardEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SleepGuardDisable(USB_MODULE_ID index)
{
     USB_SleepGuardDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsSleepEntryGuard(USB_MODULE_ID index)
{
     return USB_ExistsSleepEntryGuard_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ModuleIsBusy(USB_MODULE_ID index)
{
     return USB_ModuleIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsModuleBusy(USB_MODULE_ID index)
{
     return USB_ExistsModuleBusy_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SuspendEnable(USB_MODULE_ID index)
{
     USB_SuspendEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SuspendDisable(USB_MODULE_ID index)
{
     USB_SuspendDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsSuspend(USB_MODULE_ID index)
{
     return USB_ExistsSuspend_Default(index);
}

PLIB_INLINE_API void PLIB_USB_Enable(USB_MODULE_ID index)
{
     USB_Enable_32Bit16Bit(index);
}

PLIB_INLINE_API void PLIB_USB_Disable(USB_MODULE_ID index)
{
     USB_Disable_32Bit16Bit(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsModulePower(USB_MODULE_ID index)
{
     return USB_ExistsModulePower_32Bit16Bit(index);
}

PLIB_INLINE_API void PLIB_USB_InterruptFlagSet(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     USB_InterruptFlagSet_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_InterruptFlagClear(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     USB_InterruptFlagClear_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_InterruptFlagGet(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     return USB_InterruptFlagGet_Default(index, interruptFlag);
}

